seregonwar/Ghostpad/esp32-ghostpad/sdkconfig.defaults.esp32
CONFIG_IDF_TARGET="esp32"

CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# WiFi
# ---------------------------------------------------------------------------
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# ---------------------------------------------------------------------------
# ---------------------------------------------------------------------------
# Bluepad32 BTstack configuration
# ---------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y
CONFIG_BTDM_CTRL_MODE_BTDM=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n

# Max connections for controller
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN_EFF=7
CONFIG_BTDM_CTRL_BLE_MAX_CONN_EFF=3
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=7
CONFIG_BTDM_CTRL_BLE_MAX_CONN=3

# Bluepad32 platform configuration
CONFIG_BLUEPAD32_PLATFORM_CUSTOM=y
CONFIG_BLUEPAD32_PLATFORM_UNIJOYSTICLE=n
CONFIG_BLUEPAD32_MAX_DEVICES=4
CONFIG_BLUEPAD32_GAP_SECURITY=y
CONFIG_BLUEPAD32_LOG_LEVEL_INFO=y
CONFIG_BLUEPAD32_USB_CONSOLE_ENABLE=y
CONFIG_BLUEPAD32_ENABLE_BLE_BY_DEFAULT=y

# ---------------------------------------------------------------------------
# Ghostpad Bridge Configuration
# ---------------------------------------------------------------------------
CONFIG_GHOSTPAD_WIFI_HOSTNAME="ghostpad"
CONFIG_GHOSTPAD_STA_SSID=""
CONFIG_GHOSTPAD_STA_PASSWORD=""
CONFIG_GHOSTPAD_STA_MAX_RETRY=5
CONFIG_GHOSTPAD_STA_CONNECT_TIMEOUT_SEC=15
CONFIG_GHOSTPAD_AP_SSID="Ghostpad-ESP32"
CONFIG_GHOSTPAD_AP_PASSWORD="ghostpad123"
CONFIG_GHOSTPAD_AP_MAX_CONN=4
CONFIG_GHOSTPAD_AP_CHANNEL=1
CONFIG_GHOSTPAD_ENABLE_MDNS=y

# ---------------------------------------------------------------------------
# Compiler Optimization (Release/Size)
# ---------------------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_DEBUG=n

# ---------------------------------------------------------------------------
# Memory Optimizations (Reduce IRAM usage)
# ---------------------------------------------------------------------------
CONFIG_ESP_PHY_IRAM_OPT=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP32_WIFI_IRAM_OPT=n
CONFIG_ESP32_WIFI_RX_IRAM_OPT=n
